Revit 2027 API
Construction.Name Property
Get the name of the Construction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
String
Remarks
This property is used to get the name of the Construction.
See Also
Reference
Construction Class
Autodesk.Revit.DB Namespace